/*企业发放的奖金根据利润提成。利润低于或等于100000元的，奖金可提10%;
利润高于100000元，低于200000元（100000<I≤200000）时，低于100000元的部分按10％提成，高于100000元的部分，可提成 7.5%;
200000<I≤400000时，低于200000元部分仍按上述办法提成，（下同），高于200000元的部分按5％提成；
400000<I≤600000元时，高于400000元的部分按3％提成；

600000<I≤1000000时，高于600000元的部分按1.5%提成；
I>1000000时，超过1000000元的部分按1%提成。从键盘输入当月利润I,求应发奖金总数。*/
#include<stdio.h>
int main(){
    int l;
    int a=0,b=0,c=0,d=0,e=0,f=0;
    scanf("%d",&l);
    if (l<=100000)
    {
        a=l*0.1;
        printf("%d",a);
    }
    if (l<200000&&l>=100000)
    {
        b=10000+(l-100000)*0.075;
        printf("%d",b);
    }
    if (l>200000&&l<=400000)
    {
        c=17500+(l-20000)*0.05;
        printf("%d",c);
    }
    if (l>400000&&l<=600000)
    {
        d=27500+(l-400000)*0.03;
        printf("%d",d);
    }
    if (l>600000&&l<=1000000)
    {
        e=33500+(l-600000)*0.015;
        printf("%d",e);
    }
    if (l>1000000)
    {
        f=39500+(l-1000000)*0.01;
        printf("%d",f);
    }
    
    
    return 0;
}
